ERP.belugaerp/src/InformationRegisters/НоменклатураСегмента/НоменклатураСегмента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>НоменклатураСегмента</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions>
    <name>Сегмент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/InformationRegisters/НоменклатураСегмента/RecordSetModule.bsl
&После("ПередЗаписью")
Процедура бг_ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Сегмент = СегментНабораЗаписей(ЭтотОбъект);		
	ДополнительныеСвойства.Вставить("НоменклатураСегментаСтарая", НоменклатураСегментаВБазе(Сегмент));
	
КонецПроцедуры

Функция НоменклатураСегментаВБазе(Сегмент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураСегмента.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
		|ГДЕ
		|	НоменклатураСегмента.Сегмент = &Сегмент";	
	Запрос.УстановитьПараметр("Сегмент", Сегмент);	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Номенклатура");
	
КонецФункции

Функция СегментНабораЗаписей(НаборЗаписей)

	СегментОтбор = НаборЗаписей.Отбор.Найти("Сегмент");
	
	Сегмент = Неопределено;
	Если СегментОтбор <> Неопределено Тогда
		Сегмент = СегментОтбор.Значение;	
	КонецЕсли;
	
	Возврат Сегмент;
	
КонецФункции
